Heres the tf output:
```
➜ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.pardot-form-handler.aws_apigatewayv2_api.lambda will be created
  + resource "aws_apigatewayv2_api" "lambda" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "pardot_lambda_gateway"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
      + target                       = (known after apply)

      + cors_configuration {
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.pardot-form-handler.aws_apigatewayv2_integration.pardot_form_handler will be created
  + resource "aws_apigatewayv2_integration" "pardot_form_handler" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.pardot-form-handler.aws_apigatewayv2_route.pardot_form_handler will be created
  + resource "aws_apigatewayv2_route" "pardot_form_handler" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /submit"
      + target             = (known after apply)
    }

  # module.pardot-form-handler.aws_apigatewayv2_stage.lambda will be created
  + resource "aws_apigatewayv2_stage" "lambda" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "pardot_lambda_stage"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.pardot-form-handler.aws_cloudwatch_log_group.api_gw will be created
  + resource "aws_cloudwatch_log_group" "api_gw" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api_gw/pardot_lambda_gateway"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.pardot-form-handler.aws_cloudwatch_log_group.pardot_form_handler will be created
  + resource "aws_cloudwatch_log_group" "pardot_form_handler" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/pardot-form-handler"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.pardot-form-handler.aws_iam_role.pardot_form_handler_role will be created
  + resource "aws_iam_role" "pardot_form_handler_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pardot-form-handler-role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.pardot-form-handler.aws_iam_role_policy_attachment.lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "pardot-form-handler-role"
    }

  # module.pardot-form-handler.aws_lambda_function.pardot_form_handler will be created
  + resource "aws_lambda_function" "pardot_form_handler" {
      + arn                            = (known after apply)
      + function_name                  = "pardot-form-handler"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "pardot-form-handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "71y5bGAS58utq8CdoTYa72RD7MuWprdmzGhc/752Dz8="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "PARDOT_FORM_HANDLER_URL" = "pardot-form-handler"
              + "RECAPTCHA_SECRET"        = "6LerFZQbAAAAALV8PbSsJui9Xrjnzm8kNcn5tXoF"
              + "REDIRECT_URL"            = "https://google.com"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.pardot-form-handler.aws_lambda_permission.api_gw will be created
  + resource "aws_lambda_permission" "api_gw" {
      + action        = "lambda:InvokeFunction"
      + function_name = "pardot-form-handler"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.pardot-form-handler.aws_s3_bucket.pardot_form_handler_lambda will be created
  + resource "aws_s3_bucket" "pardot_form_handler_lambda" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "pardot-form-handler-lambda"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.pardot-form-handler.aws_s3_bucket_object.pardot_lambda_source_object will be created
  + resource "aws_s3_bucket_object" "pardot_lambda_source_object" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "4504af42a9bb1464187b40c4cbb2afc8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "pardot-form-handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../dist/pardot-form-handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```

Error when hitting the lambda though
```
2022-02-23T01:14:02.547Z	undefined	ERROR	Uncaught Exception 	
{
    "errorType": "Runtime.HandlerNotFound",
    "errorMessage": "index.handler is undefined or not exported",
    "stack": [
        "Runtime.HandlerNotFound: index.handler is undefined or not exported",
        "    at Object.module.exports.load (/var/runtime/UserFunction.js:246:11)",
        "    at Object.<anonymous> (/var/runtime/index.js:43:30)",
        "    at Module._compile (internal/modules/cjs/loader.js:1085:14)",
        "    at Object.Module._extensions..js (internal/modules/cjs/loader.js:1114:10)",
        "    at Module.load (internal/modules/cjs/loader.js:950:32)",
        "    at Function.Module._load (internal/modules/cjs/loader.js:790:12)",
        "    at Function.executeUserEntryPoint [as runMain] (internal/modules/run_main.js:76:12)",
        "    at internal/main/run_main_module.js:17:47"
    ]
}
```
